month = int(input( "Введите номер месяца: " ))
# month = 15
if month > 0:
    if month <= 12:
        my_dict = {1 : "зима", 2 : "зима", 3 : "зима", 4 : "весна",5 : "весна",6 : "весна", 7 : "лето", 8 : "лето" , 9 : "лето" , 10 : "осень", 11 : "осень", 12 : "осень"}
        list_seasons = ["зима", "зима", "зима", "весна", "весна", "весна", "лето", "лето", "лето", "осень", "осень",
                        "осень"]
        # season = (my_dict.get( month ))
        # print(my_dict.get( month ))
        print(f"Введеный Вами номер месяца соотвествует времени года --", my_dict.get(month),". Спасибо!")
        print(f"Проверка через функцию list --", list_seasons[month], ". Спасибо!")
    else:
        print("Неправильное число! Введите номер месяца в диапазоне от 1 до 12 !")

# можно реализовать через list




