a = 2
b = 5 + a
c = b * a
d = c // 2
e = d % 2
g = e / b
print("Значение переменной 'а' составляет число:", a)
print("Значение переменной 'b' вычислется как сумма переменной 'а' и числа 5 и составляет:", b)
print("Значение переменной 'c' вычислется как произведение переменных 'а' и 'b' и составляет:", c)
print("Значение переменной 'd' вычислется как целое число от частного переменной 'c' числа 2 и составляет:", d)
print("Остаток от деления переменной 'd' на число 2 составлет:", e)
print("Частное от деления переменной 'e' на переменную 'b' составляет:", g, "с точностью до 17 знака после запятой.")